Repository: igodip/calisthenics-app
Catalog: lib/l10n/app_*.arb
Languages: it

# exerciseTargetRepsLabel
source: Target reps
it: Ripetizioni obiettivo

# exerciseTargetRepsHelper
source: Optional total goal for the session
it: Obiettivo totale opzionale per la sessione

# exerciseRestDurationLabel
source: Rest duration (seconds)
it: Durata recupero (secondi)

# exerciseRestDurationHelper
source: Optional countdown timer preset
it: Preset opzionale per il conto alla rovescia

# exerciseTrackerEmpty
source: No exercises yet. Tap + to add one!
it: Ancora nessun esercizio. Tocca + per aggiungerne uno!

# exerciseAddButton
source: Add exercise
it: Aggiungi esercizio

# exercisePushUps
source: Push-ups
it: Push-up

# exercisePullUps
source: Pull-ups
it: Trazioni alla sbarra

# exerciseChinUps
source: Chin-ups
it: Trazioni a presa inversa

# exerciseTotalReps
source: {count} total reps
it: {count} ripetizioni totali

# exerciseGoalProgress
source: {logged} / {goal} reps logged
it: {logged} / {goal} ripetizioni registrate

# exerciseRestFinished
source: Rest finished for {exercise}!
it: Recupero terminato per {exercise}!

# exerciseSetRestDuration
source: Set rest duration
it: Imposta durata recupero

# exerciseDurationSecondsLabel
source: Duration (seconds)
it: Durata (secondi)

# restTimerLabel
source: Rest timer
it: Timer di recupero

source: Set duration
it: Imposta durata

source: Undo last set
it: Annulla ultima serie

source: Custom
it: Personalizzato

source: Reset
it: Reimposta

# logRepsTitle
source: Log reps
it: Registra ripetizioni

# repetitionsLabel
source: Repetitions
it: Ripetizioni

# positiveNumberError
source: Enter a positive number.
it: Inserisci un numero positivo.

# repsChip
source: {count} reps
it: {count} ripetizioni

source: Goal: {count}
it: Obiettivo: {count}

source: Rep goal reached!
it: Obiettivo ripetizioni raggiunto!

source: Pause
it: Pausa

source: Start
it: Avvia

# seriesCount
source: Sets: {count}
it: Serie: {count}

source: Reset reps
it: Azzera ripetizioni

# emomTrackerTitle
source: EMOM tracker
it: Tracker EMOM

# emomTrackerSubtitle
source: Guided every-minute sets with prep countdown.
it: Serie ogni minuto con conto alla rovescia.

# emomTrackerDescription
source: Configure sets, reps, and intervals to stay on pace each minute.
it: Configura serie, ripetizioni e intervalli per restare sul ritmo ogni minuto.

# emomSetsLabel
source: Total sets
it: Serie totali

# emomRepsLabel
source: Reps per set
it: Ripetizioni per serie

# emomIntervalLabel
source: Interval (seconds)
it: Intervallo (secondi)

# emomStartButton
source: Start EMOM
it: Avvia EMOM

# emomResetButton
source: Reset session
it: Reimposta sessione

# emomSessionComplete
source: EMOM complete
it: EMOM completato

# emomCurrentSet
source: Set {current} of {total}
it: Serie {current} di {total}

# emomRepsPerSet
source: {count} reps per set
it: {count} ripetizioni per serie

# emomFinishedMessage
source: Nice work! You hit every minute.
it: Ottimo lavoro! Hai rispettato ogni minuto.

# emomTimeRemainingLabel
source: Time remaining this minute
it: Tempo rimanente in questo minuto

# emomPrepHeadline
source: Get ready for set {set}
it: Preparati per la serie {set}

# emomPrepSubhead
source: The next set starts after this countdown.
it: La prossima serie parte alla fine del conto alla rovescia.

# weekdayMonday
source: Monday
it: Lunedì

# weekdayTuesday
source: Tuesday
it: Martedì

# weekdayWednesday
source: Wednesday
it: Mercoledì

# weekdayThursday
source: Thursday
it: Giovedì

# weekdayFriday
source: Friday
it: Venerdì

# weekdaySaturday
source: Saturday
it: Sabato

# weekdaySunday
source: Sunday
it: Domenica

# weekNumber
source: Week {week}
it: Settimana {week}

# defaultWorkoutTitle
source: Workout
it: Allenamento

# terminologyTitle
source: Terminology
it: Terminologia

# termRepsTitle
source: Reps
it: Reps (Ripetizioni)

# termRepsDescription
source: Number of times you perform an exercise consecutively.
it: Numero di volte che esegui un esercizio consecutivamente.

# termSetTitle
source: Set
it: Set (Serie)

# termSetDescription
source: A group of repetitions. For example: 3 sets of 10 reps means 30 repetitions total divided into 3 groups.
it: Un gruppo di ripetizioni. Es: 3 serie da 10 reps significa 30 ripetizioni totali, divise in 3 gruppi.

# termRtDescription
source: Total Repetitions: perform all the reps with your preferred sets, reps, and tempo (if not specified).
it: Ripetizioni Totali: indica che devi fare tutte quelle reps, con libera scelta di serie, ripetizioni e tempo (se non indicato).

# termAmrapDescription
source: As Many Reps As Possible: perform as many reps as you can in a given time.
it: As Many Reps As Possible: esegui quante più ripetizioni possibili in un tempo determinato.

# termEmomDescription
source: Every Minute on the Minute: start a set every minute. Rest during the remaining time.
it: Every Minute On Minute: inizi un set ogni minuto. Il tempo restante serve per riposare.

# termRampingDescription
source: Method where the load increases with each set.
it: Metodo che prevede un incremento del peso ad ogni serie

# termMavDescription
source: Massima Alzata Veloce: perform as many reps as possible with a load while keeping control and good speed.
it: Massima Alzata Veloce: si riferisce a una metodologia in cui si cerca di eseguire il maggior numero di ripetizioni possibili con un carico, mantenendo sempre il controllo del movimento e una buona velocità di esecuzione.

# termIsocineticiTitle
source: Isokinetic
it: Isocinetici

# termIsocineticiDescription
source: Exercises performed at a constant speed.
it: Esercizi svolti a velocità costante.

# termTutDescription
source: Indicates how long a repetition should last. You can manage the duration of each phase.
it: Indica quanto deve durare una ripetizione. Puoi gestire tu la durata di ogni fase della rep.

# termIsoDescription
source: Indicates a pause at a specific point of the repetition.
it: Indica il fermo a un punto specifico dell'esecuzione della rep

# termSomDescription
source: Indicates the duration of each phase of the repetition.
it: Indica la durata di ogni fase della ripetizione.

# termScaricoTitle
source: Deload
it: Scarico

# termScaricoDescription
source: Last week of the program to prepare for max attempts.
it: Ultima settimana della scheda per prepararsi ai massimali.

# noCameras
source: No cameras available
it: Nessuna fotocamera disponibile

# cameraInitFailed
source: Camera init failed: {error}
it: Inizializzazione fotocamera fallita: {error}

source: Pose detected
it: Posa rilevata

source: Processing…
it: Elaborazione…

source: Idle
it: In attesa

# cameraFront
source: front
it: frontale

# cameraBack
source: back
it: posteriore
