Repository: igodip/calisthenics-app
Catalog: lib/l10n/app_*.arb
Languages: it

# authErrorMessage
source: Authentication error
it: Errore durante l'autenticazione

# navGuides
source: Guides
it: Guide

# navProfile
source: Profile
it: Profilo

# navTerminology
source: Terminology
it: Terminologia

# onboardingTitleOne
source: Train smarter
it: Allenati meglio

# onboardingDescriptionOne
source: Follow guided workouts built for your calisthenics plan.
it: Segui allenamenti guidati creati per il tuo piano di calisthenics.

# onboardingTitleTwo
source: Track progress
it: Monitora i progressi

# onboardingDescriptionTwo
source: Log sets, reps, and notes to see your improvements.
it: Registra serie, ripetizioni e note per vedere i miglioramenti.

# onboardingTitleThree
source: Stay consistent
it: Rimani costante

# onboardingDescriptionThree
source: Keep momentum with quick access to your next session.
it: Mantieni il ritmo con accesso rapido alla prossima sessione.

# onboardingSkip
source: Skip
it: Salta

# onboardingBack
source: Back
it: Indietro

# onboardingNext
source: Next
it: Avanti

# onboardingGetStarted
source: Get started
it: Inizia

# guidesTitle
source: Exercise walkthroughs
it: Guida agli esercizi

# guidesSubtitle
source: Learn form cues, key checkpoints, and watch the movement before you train.
it: Scopri la tecnica corretta, i punti chiave e guarda il movimento prima di allenarti.

# guidesPrimaryFocus
source: Primary focus
it: Focus principale

# guidesCoachTip
source: Coach tip
it: Consiglio del coach

# guidesWatchVideo
source: Watch tutorial video
it: Guarda il tutorial

# guidesVideoUnavailable
source: Could not open the tutorial right now.
it: Impossibile aprire il tutorial in questo momento.

# difficultyBeginner
source: Beginner
it: Principiante

# difficultyIntermediate
source: Intermediate
it: Intermedio

# difficultyAdvanced
source: Advanced
it: Avanzato

# guidesPullupName
source: Pull-up
it: Trazioni

# guidesPullupFocus
source: Lats, biceps, grip
it: Dorsali, bicipiti, presa

# guidesPullupTip
source: Drive elbows toward your ribs and keep your ribs tucked to avoid swinging.
it: Spingi i gomiti verso le costole e tieni le costole chiuse per evitare oscillazioni.

# guidesPullupDescription
source: Start from a hollow body hang, then pull until your chin clears the bar. Control the descent for stronger reps.
it: Parti da una sospensione in hollow body, poi tira finché il mento supera la sbarra. Controlla la discesa per ripetizioni più forti.

# guidesPushupName
source: Push-up
it: Piegamenti

# guidesPushupFocus
source: Chest, triceps, core
it: Petto, tricipiti, core

# guidesPushupTip
source: Squeeze your glutes and keep a straight line from head to heels.
it: Contrai i glutei e mantieni una linea dritta dalla testa ai talloni.

# guidesPushupDescription
source: Lower with elbows at roughly 45° to your torso, touch your chest lightly, then press back up without letting hips sag.
it: Scendi con i gomiti a circa 45° rispetto al busto, sfiora il petto e risali senza lasciare che i fianchi cedano.

# guidesBodyweightSquatName
source: Bodyweight squat
it: Squat a corpo libero

# guidesBodyweightSquatFocus
source: Quads, glutes, core
it: Quadricipiti, glutei, core

# guidesBodyweightSquatTip
source: Push your knees out as you descend and keep your heels planted.
it: Spingi le ginocchia verso l'esterno durante la discesa e mantieni i talloni a terra.

# guidesBodyweightSquatDescription
source: Sit the hips back and down until thighs are at least parallel. Drive evenly through the whole foot to stand tall.
it: Porta indietro e in basso le anche finché le cosce sono almeno parallele. Spingi uniformemente su tutto il piede per tornare in piedi.

# guidesHangingLegRaiseName
source: Hanging leg raise
it: Sollevamento gambe alla sbarra

# guidesHangingLegRaiseFocus
source: Abdominals, hip flexors, grip
it: Addominali, flessori dell'anca, presa

# guidesHangingLegRaiseTip
source: Initiate each rep by engaging your lats to steady the torso.
it: Inizia ogni ripetizione attivando i dorsali per stabilizzare il busto.

# guidesHangingLegRaiseDescription
source: From a dead hang, lift your legs together until they reach hip height or higher. Lower slowly to keep tension.
it: Da una sospensione completa, solleva le gambe unite fino all'altezza delle anche o più in alto. Scendi lentamente per mantenere tensione.

# guidesMuscleUpFocus
source: Lats, chest, triceps, transition strength
it: Dorsali, petto, tricipiti, forza nella transizione

# guidesMuscleUpTip
source: Pull high to your upper chest and keep the bar close to reduce the swing.
it: Tira in alto verso la parte alta del petto e tieni la sbarra vicina per ridurre l'oscillazione.

# guidesMuscleUpDescription
source: From a controlled hang, explode into a high pull, transition the wrists over the bar, and press to lockout.
it: Da una sospensione controllata, esplodi in una trazione alta, porta i polsi sopra la sbarra e spingi fino al blocco.

# guidesStraightBarDipName
source: Straight bar dip
it: Dip alla sbarra

# guidesStraightBarDipFocus
source: Chest, triceps, shoulders
it: Petto, tricipiti, spalle

# guidesStraightBarDipTip
source: Keep elbows tucked and press down while leaning slightly forward.
it: Tieni i gomiti vicini al corpo e spingi verso il basso con una leggera inclinazione in avanti.

# guidesStraightBarDipDescription
source: Start on top of the bar with locked elbows, lower under control until shoulders dip below elbows, then drive back up.
it: Parti sopra la sbarra con gomiti bloccati, scendi controllando finché le spalle scendono sotto i gomiti, poi risali.

# guidesDipsName
source: Dips
it: Dip alle parallele

# guidesDipsFocus
source: Chest, triceps, shoulders
it: Petto, tricipiti, spalle

# guidesDipsTip
source: Lean slightly forward and keep shoulders packed to protect the joints.
it: Inclina leggermente il busto in avanti e mantieni le spalle compatte per proteggere le articolazioni.

# guidesDipsDescription
source: Start locked out on parallel bars, lower until shoulders dip below elbows, then press back to a strong lockout.
it: Parti in blocco sulle parallele, scendi finché le spalle vanno sotto i gomiti, poi risali fino a un blocco forte.

# guidesAustralianRowName
source: Australian row
it: Rematore australiano

# guidesAustralianRowFocus
source: Upper back, biceps, core
it: Dorsali alti, bicipiti, core

# guidesAustralianRowTip
source: Brace your core and keep a straight line from shoulders to heels.
it: Attiva il core e mantieni una linea dritta dalle spalle ai talloni.

# guidesAustralianRowDescription
source: Set the bar at waist height, hang underneath, and row your chest to the bar with elbows tight.
it: Imposta la sbarra all'altezza della vita, appenditi sotto e tira il petto verso la sbarra con gomiti stretti.

# guidesPikePushUpName
source: Pike push-up
it: Piegamenti in pike

# guidesPikePushUpFocus
source: Shoulders, triceps, core
it: Spalle, tricipiti, core

# guidesPikePushUpTip
source: Keep hips high and lower your head to a spot just in front of your hands.
it: Tieni i fianchi alti e abbassa la testa verso un punto appena davanti alle mani.

# guidesPikePushUpDescription
source: From a pike position, bend elbows to bring the head down, then press back to a strong lockout.
it: Da una posizione a pike, piega i gomiti per portare la testa in basso, poi spingi fino a un blocco forte.

source: Settings coming soon.
it: Le impostazioni saranno presto disponibili.

# settingsGeneralSection
source: General
it: Generali

# settingsDailyReminder
source: Daily workout reminder
it: Promemoria allenamento quotidiano

# settingsDailyReminderDescription
source: Get a gentle nudge to start training each day.
it: Ricevi un promemoria per iniziare ad allenarti ogni giorno.

# settingsReminderTime
source: Reminder time
it: Orario promemoria

# settingsReminderNotSet
source: Not set
it: Non impostato

# settingsSoundEffects
source: Sound effects
it: Effetti sonori

# settingsSoundEffectsDescription
source: Play short sounds when logging repetitions.
it: Riproduci brevi suoni durante la registrazione delle ripetizioni.

# settingsHapticFeedback
source: Haptic feedback
it: Feedback aptico

# settingsHapticFeedbackDescription
source: Vibrate briefly on important actions.
it: Leggera vibrazione per le azioni importanti.

# settingsTrainingSection
source: Training preferences
it: Preferenze di allenamento

# settingsUnitSystem
source: Unit system
it: Sistema di unità

# settingsUnitsMetric
source: Metric (kg)
it: Metrico (kg)

# settingsUnitsImperial
source: Imperial (lb)
it: Imperiale (lb)

# settingsRestTimer
source: Default rest timer
it: Timer di recupero predefinito

# settingsRestTimerDescription
source: Used when starting a rest timer from workouts.
it: Usato quando avvii un timer di recupero dagli allenamenti.

# settingsRestTimerMinutes
source: {count, plural, one {# minute} other {# minutes}}
it: {count, plural, one {# minuto} other {# minuti}}

# settingsRestTimerMinutesSeconds
source: {minutes, plural, one {# minute} other {# minutes}} and {seconds, plural, one {# second} other {# seconds}}
it: {minutes, plural, one {# minuto} other {# minuti}} e {seconds, plural, one {# secondo} other {# secondi}}

# settingsRestTimerSeconds
source: {count, plural, one {# second} other {# seconds}}
it: {count, plural, one {# secondo} other {# secondi}}

# settingsDataSection
source: Data & privacy
it: Dati e privacy

# settingsClearCache
source: Clear cached workouts
it: Cancella allenamenti salvati

# settingsClearCacheDescription
source: Remove workouts saved on this device.
it: Rimuovi gli allenamenti memorizzati su questo dispositivo.

# settingsClearCacheSuccess
source: Local workouts cleared.
it: Allenamenti locali rimossi.

# settingsExportData
source: Export training summary
it: Esporta riepilogo allenamenti

# settingsExportDataDescription
source: Receive a CSV of your recent sessions via email.
it: Ricevi via email un CSV delle ultime sessioni.

# settingsExportDataSuccess
source: Export request submitted. Check your inbox soon.
it: Richiesta di esportazione inviata. Controlla la casella di posta a breve.

# settingsSupportSection
source: Support
it: Supporto

# settingsContactCoach
source: Contact your coach
it: Contatta il tuo coach

# settingsContactCoachDescription
source: Send a quick message for adjustments.
it: Invia un messaggio rapido per chiedere modifiche.

# settingsContactCoachHint
source: Let us know how we can help.
it: Dicci come possiamo aiutarti.

# settingsContactCoachSuccess
source: Message sent to your coach.
it: Messaggio inviato al coach.

# settingsSendMessage
source: Send message
it: Invia messaggio

# settingsAppVersion
source: App version
it: Versione app

# settingsAppVersionValue
source: Version {version}
it: Versione {version}

# exerciseTrackerTitle
source: Exercise tracker
it: Tracker esercizi

# poseEstimationTitle
source: Pose estimation
it: Stima postura

# homeLoadErrorTitle
source: Unable to load workouts
it: Impossibile caricare gli allenamenti

source: Retry
it: Riprova

# homeCalendarTitle
source: Workout calendar
it: Calendario allenamenti

# homeCalendarSubtitle
source: Workout days are highlighted.
it: I giorni di allenamento sono evidenziati.

# homeScheduleTitle
source: Weekly focus
it: Focus settimanale

# homeScheduleSubtitle
source: Stay on track with your upcoming sessions.
it: Rimani sul pezzo con le prossime sessioni.

# homeNextWorkoutTitle
source: Next workout
it: Prossimo allenamento

# homeNextWorkoutEmpty
source: No scheduled workouts yet.
it: Nessun allenamento programmato.

# homeWorkoutsThisWeekTitle
source: This week
it: Questa settimana

# homeWorkoutsThisMonthTitle
source: This month
it: Questo mese

# homeUpcomingWeekTitle
source: Coming up this week
it: In arrivo questa settimana

# homeUpcomingWeekEmpty
source: No sessions scheduled for the next 7 days.
it: Nessuna sessione programmata nei prossimi 7 giorni.

# homeWorkoutPlanTitle
source: Workout plan
it: Piano di allenamento

# homeWorkoutPlanSubtitle
source: Review your assigned plan and upcoming sessions.
it: Rivedi il piano assegnato e le prossime sessioni.

# homeTraineeFeedbackTitle
source: Trainee feedback
it: Feedback atleta

# homeTraineeFeedbackSubtitle
source: Share updates with your coach after sessions.
it: Condividi aggiornamenti con il tuo coach dopo le sessioni.

# homeCoachTipTitle
source: Coach tip
it: Consiglio del coach

# homeCoachTipPlaceholder
source: Your coach's latest tip will appear here.
it: Qui troverai l'ultimo consiglio del tuo coach.

# workoutPlanTitle
source: Workout plan
it: Piano di allenamento

# traineeFeedbackTitle
source: Trainee feedback
it: Feedback atleta

# traineeFeedbackSubtitle
source: Tell your coach how you're feeling and how the plan is going.
it: Racconta al tuo coach come ti senti e come procede il piano.

# traineeFeedbackHighlightsLabel
source: Highlights
it: Punti forti

# traineeFeedbackHighlightsHint
source: What felt good or went well?
it: Cosa è andato bene o ti è piaciuto?

# traineeFeedbackChallengesLabel
source: Challenges
it: Difficoltà

# traineeFeedbackChallengesHint
source: What felt difficult or needs adjustment?
it: Cosa è stato difficile o da adattare?

# traineeFeedbackNotesLabel
source: Coach notes
it: Note per il coach

# traineeFeedbackNotesHint
source: Anything else to share?
it: Hai altro da condividere?

# traineeFeedbackSubmit
source: Send feedback
it: Invia feedback

# traineeFeedbackSubmitted
source: Feedback saved. We'll share it with your coach.
it: Feedback salvato. Lo condivideremo con il tuo coach.

# homeEmptyTitle
source: No workouts available
it: Nessun allenamento disponibile

# homeEmptyDescription
source: Contact your coach to receive a new plan.
it: Contatta il tuo coach per ricevere una nuova scheda.

# homePlansSectionTitle
source: Workout plans
it: Piani di allenamento

# homePlansSectionSubtitle
source: Plans assigned to you and their current status.
it: Piani assegnati e il loro stato attuale.

# homePlansEmptyTitle
source: No workout plans yet
it: Nessun piano di allenamento

# homePlansEmptyDescription
source: Ask your coach to assign a plan to see it here.
it: Chiedi al tuo coach di assegnarti un piano per vederlo qui.

# homePlanStatusDraft
source: Draft
it: Bozza

# homePlanStatusArchived
source: Archived
it: Archiviato

# homePlanStatusUpcoming
source: Upcoming
it: In arrivo

# homePlanStatusUnknown
source: Unknown status
it: Stato sconosciuto

# homePlanDefaultTitle
source: Workout plan
it: Piano di allenamento

# homePlanLatestLabel
source: Latest plan
it: Ultimo piano

# homePlanStartedLabel
source: Started {date}
it: Iniziato il {date}

# unauthenticated
source: User not authenticated
it: Utente non autenticato

# defaultExerciseName
source: Exercise
it: Esercizio

source: General notes
it: Note generali

# trainingHeaderExercise
source: Exercise
it: Esercizio

# trainingHeaderSets
source: Sets
it: Serie

# trainingHeaderReps
source: Repetitions
it: Ripetizioni

# trainingHeaderRest
source: Rest
it: Recupero

# trainingHeaderIntensity
source: Intensity
it: Intensità

# trainingHeaderNotes
source: Notes
it: Note

# trainingNotesLabel
source: Exercise notes
it: Note dell'esercizio

# trainingTraineeNotesLabel
source: Trainee notes
it: Note del tirocinante

# trainingNotesSave
source: Save notes
it: Salva note

# trainingNotesSaved
source: Notes saved
it: Note salvate

# trainingNotesError
source: Unable to save notes: {error}
it: Impossibile salvare le note: {error}

# trainingNotesUnavailable
source: Cannot update notes for this exercise.
it: Impossibile aggiornare le note per questo esercizio.

# trainingOpenTracker
source: Open tracker
it: Apri tracker

# trainingMarkComplete
source: Mark day as complete
it: Segna giorno come completato

# trainingMarkIncomplete
source: Mark day as incomplete
it: Segna giorno come incompleto

# trainingCompletionSaved
source: Workout day updated
it: Allenamento aggiornato

# trainingCompletionError
source: Unable to update workout: {error}
it: Impossibile aggiornare l'allenamento: {error}

# trainingCompletionUnavailable
source: Cannot update this workout day.
it: Impossibile aggiornare questo giorno di allenamento.

# trainingExerciseCompletedLabel
source: Exercise completed
it: Esercizio completato

# trainingExerciseCompletionSaved
source: Exercise updated
it: Esercizio aggiornato

# trainingExerciseCompletionError
source: Unable to update exercise: {error}
it: Impossibile aggiornare l'esercizio: {error}

# trainingExerciseCompletionUnavailable
source: Cannot update this exercise.
it: Impossibile aggiornare questo esercizio.

# logoutError
source: Error while logging out: {error}
it: Errore durante il logout: {error}

# profileFallbackName
source: User
it: Utente

# userNotFound
source: User not found in the database
it: Utente non trovato nel database

# profileLoadError
source: Error loading data
it: Errore nel caricamento dati

# profileNoData
source: No data available
it: Nessun dato disponibile

# profileEmailUnavailable
source: Email not available
it: Email non disponibile

# profileStatusActive
source: Active account
it: Account attivo

# profileStatusInactive
source: Inactive account
it: Account inattivo

# profilePlanActive
source: Active plan
it: Piano attivo

# profilePlanExpired
source: Plan expired
it: Piano scaduto

# profileLastUpdated
source: Last updated
it: Ultimo aggiornamento

# profileValueUnavailable
source: Not available
it: Non disponibile

# profileTimezone
source: Time zone
it: Fuso orario

# profileNotSet
source: Not set
it: Non impostato

# profileUnitSystem
source: Unit system
it: Unità di misura

# profileWeight
source: Weight
it: Peso

# profileMaxTestsTitle
source: Max test tracking
it: Test massimali

# profileMaxTestsDescription
source: Log your best attempts to see how your strength evolves over time.
it: Tieni traccia dei tuoi massimali per vedere come progredisci nel tempo.

# profileMaxTestsAdd
source: Add max test
it: Aggiungi test massimale

# profileMaxTestsRefresh
source: Refresh
it: Aggiorna

# profileMaxTestsEmpty
source: No max tests recorded yet. Add your first attempt to start tracking progress.
it: Nessun test massimale registrato. Aggiungi il primo per iniziare a tracciare i progressi.

# profileMaxTestsError
source: Unable to load max tests: {error}
it: Impossibile caricare i test massimali: {error}

# profileMaxTestsExerciseLabel
source: Exercise
it: Esercizio

# profileMaxTestsExerciseHint
source: e.g. Pull ups or Push ups
it: es. trazioni o piegamenti

# profileMaxTestsValueLabel
source: Result
it: Risultato

# profileMaxTestsValueHint
source: Enter a positive value
it: Inserisci un valore positivo

# profileMaxTestsUnitLabel
source: Unit
it: Unità

# profileMaxTestsUnitHint
source: e.g. reps, kg, sec
it: es. rip, kg, sec

# profileMaxTestsDateLabel
source: Recorded on {date}
it: Registrato il {date}

# profileMaxTestsCancel
source: Cancel
it: Annulla

# profileMaxTestsSave
source: Save test
it: Salva test

# profileMaxTestsSaveSuccess
source: Max test saved
it: Test massimale salvato

# profileMaxTestsSaveError
source: Unable to save test: {error}
it: Impossibile salvare il test: {error}

# profileMaxTestsDefaultUnit
source: reps
it: ripetizioni

# profileMaxTestsBestLabel
source: Personal best
it: Miglior risultato

# profileMaxTestsShowMore
source: Show all attempts
it: Mostra tutti i tentativi

# profileMaxTestsShowLess
source: Show fewer attempts
it: Mostra meno tentativi

# profileEdit
source: Edit profile
it: Modifica profilo

# profileComingSoon
source: Coming soon
it: Presto disponibile

# profileEditSubtitle
source: Update your personal details
it: Aggiorna le tue informazioni personali

# profileEditTitle
source: Edit profile
it: Modifica profilo

# profileEditFullNameLabel
source: Full name
it: Nome completo

# profileEditFullNameHint
source: How should we call you?
it: Come vuoi essere chiamato?

# profileEditWeightLabel
source: Weight
it: Peso

# profileEditWeightHint
source: Enter your weight in kg (optional)
it: Inserisci il tuo peso in kg (opzionale)

# profileEditWeightInvalid
source: Enter a valid positive weight.
it: Inserisci un peso valido e positivo.

# profileEditTimezoneLabel
source: Time zone
it: Fuso orario

# profileEditTimezoneHint
source: Example: Europe/Rome
it: Esempio: Europe/Rome

# profileEditUnitSystemLabel
source: Preferred unit system
it: Unità di misura preferita

# profileEditUnitSystemNotSet
source: Not specified
it: Non specificato

# profileEditUnitSystemMetric
source: Metric (kg, cm)
it: Metrico (kg, cm)

# profileEditUnitSystemImperial
source: Imperial (lb, in)
it: Imperiale (lb, in)

# profileEditCancel
source: Cancel
it: Annulla

# profileEditSave
source: Save changes
it: Salva modifiche

# profileEditSuccess
source: Profile updated successfully
it: Profilo aggiornato correttamente

# profileEditError
source: Unable to update profile: {error}
it: Impossibile aggiornare il profilo: {error}

# featureUnavailable
source: Feature not available yet.
it: Funzionalità non ancora disponibile.

# redirectError
source: Error during redirect: {error}
it: Errore durante il reindirizzamento: {error}

# linkError
source: Link error: {error}
it: Errore collegamento: {error}

# missingFieldsError
source: Please fill out all required fields.
it: Compila tutti i campi richiesti.

# passwordMismatch
source: Passwords do not match.
it: Le password non coincidono.

source: Invalid credentials.
it: Credenziali errate.

# signupEmailCheck
source: Sign-up complete! Check your email to confirm your account.
it: Registrazione completata! Controlla la tua email per confermare l'account.

# unexpectedError
source: Unexpected error: {error}
it: Errore inatteso: {error}

# loginGreeting
source: Welcome back! Sign in to continue your training.
it: Bentornato! Accedi per continuare il tuo allenamento.

# signupGreeting
source: Create an account to unlock all workouts.
it: Crea un account per sbloccare tutti gli allenamenti.

# confirmPasswordLabel
source: Confirm password
it: Conferma password

# loginButton
source: Sign in
it: Accedi

# signupButton
source: Sign up
it: Registrati

# noAccountPrompt
source: Don't have an account? Sign up
it: Non hai un account? Registrati

# existingAccountPrompt
source: Already have an account? Sign in
it: Hai già un account? Accedi

# passwordResetEmailSent
source: Password reset link sent to {email}. Check your inbox.
it: Link per reimpostare la password inviato a {email}. Controlla la posta.

# passwordResetEmailMissing
source: Enter your email to receive a reset link.
it: Inserisci la tua email per ricevere il link di reimpostazione.

# passwordResetDialogTitle
source: Choose a new password
it: Scegli una nuova password

# passwordResetDialogDescription
source: Enter a new password to secure your account.
it: Inserisci una nuova password per mettere al sicuro il tuo account.

# passwordResetNewPasswordLabel
source: New password
it: Nuova password

# passwordResetConfirmPasswordLabel
source: Confirm new password
it: Conferma nuova password

# passwordResetMismatch
source: Passwords do not match.
it: Le password non coincidono.

# passwordResetSuccess
source: Password updated successfully. You can continue using the app.
it: Password aggiornata con successo. Puoi continuare a usare l'app.

# passwordResetSubmit
source: Update password
it: Aggiorna password

# exerciseAddDialogTitle
source: Add exercise
it: Aggiungi esercizio

# exerciseNameLabel
source: Exercise name
it: Nome esercizio

# quickAddValuesLabel
source: Quick add values
it: Valori rapidi

# quickAddValuesHelper
source: Comma separated repetitions (e.g. 1,5,10)
it: Ripetizioni separate da virgola (es. 1,5,10)

source: Cancel
it: Annulla

source: Add
it: Aggiungi

source: Save
it: Salva

# exerciseNameMissing
source: Please provide a name.
it: Inserisci un nome.
